name: "ensemble"

platform: "ensemble"

max_batch_size : 0

input [
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  },
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  },
  {
    name: "token_type_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  }
]

output [
  {
    name: "last_hidden_state"
    data_type: TYPE_FP32
    dims: [ -1, -1, 768 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "nomic-embed-text-v1.5"
      model_version: -1
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "token_type_ids"
        value: "token_type_ids"
      }
      output_map {
        key: "last_hidden_state"
        value: "last_hidden_state"
      }
    }
  ]
}
