name: "nomic-embed-text-v1.5"

platform: "onnxruntime_onnx"

max_batch_size : 0

input [
  {
    name: "input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 768 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

